{
  "title": "CFD Essentials - Lecture 3",
  "pages": [
    {
      "id": "",
      "title": "",
      "transcript": "Hello, my name is Thomas Fitzgibbon from Flexcompute and today I will present the first part of CFD Simulation Methods for High-Lift Aircraft Configurations focused on RANS modelling sensitivities"
    },
    {
      "id": "",
      "title": "",
      "transcript": "The work performed in this study was performed as part of the AIAA High-Lift Prediction Workshop. These types of configurations operate near CL max, and therefore are associated with highly complex flow physics due to flow separation and multiple unsteady interactions between many vortical structures and shear layers. These types of flows are a major challenge from both a meshing and modelling perspective. The aim of the current work is to establish RANS best-practices for high-lift flows and to assess the suitability of RANS for these types of predictions. To support our conclusions higher-fidelity DES simulations are also performed, which will be presented in the second part of this video series."
    },
    {
      "id": "",
      "title": "",
      "transcript": "The geometry under consideration is the publicly available half-body high-Lift Common Research Model. In the current work we focus on the CL max study which involves an alpha sweep from low angles of attack in the linear region of the lift curve, through to CL max and into the stall region. For our CFD simulations, we used a family of ANSA grids generated by BETA-CAE and a family of committee generated Pointwise grids, which are available on the High Lift Prediction Workshop website."
    },
    {
      "id": "",
      "title": "",
      "transcript": "We begin our study by examining RANS modelling sensitivities by looking at the effect of mesh refinement for the family of ANSA grids. The integrated loads are presented on the slide with different grid resolution. In the linear region, the results show a high degree of consistency, however, at high alpha, the agreement with experiment worsens as the grid is refined."
    },
    {
      "id": "",
      "title": "",
      "transcript": "The primary reason for this, looking at the skin friction contours at an alpha of 19.57 degrees, is the flow topology in the root region as well as past the nacelle. The levels of separation appear to be highly sensitive to grid refinement and resolution of the key vortical structures present in the flowfield coming from the slats, slat junctions, nacelle pylon junction and chine, leading to significant differences in the separation at the root of the wing. Outboards, however, a high degree of consistency is seen between the three grids, with all solutions predicting large regions of separated flow across the wing tip."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Examining mesh sensitivity effects further, we compare predictions from two different grid families – the Pointwise and ANSA grids. The C Level ANSA grid and D Level Pointwise grid have a similar resolution of around 200 million nodes. Based on the presented figures, it can be stated that the two grids were designed with completely different philosophies. The ANSA grid aims to resolve the key vortical structures in the flow with targeted refinement regions, leading to a coarser mesh at surface level as well as away from the targeted regions. The Pointwise grid uses a more uniformly spaced surface grid with more global regions of refinement in the volume mesh that target the aircraft wake as a whole rather than individual flow features."
    },
    {
      "id": "",
      "title": "",
      "transcript": "The effect of these grid resolution strategies is a slightly better integrated load prediction for the ANSA grid, when compared to experiments. The agreement between the two grids is very good in the linear region, with the Pointwise grid leading to a slightly higher lift as well as drag before stall. The Pointwise grid, however, stalls earlier than the ANSA grid, leading to poorer agreement in both lift and drag at high alpha."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To examine the differences between the Pointwise and ANSA grids further, the skin friction contours are extracted. At an angle of attack of 19.57 degrees, a significant region of separation is seen past the nacelle for the Pointwise grid, which leads to the lower lift prediction. Some differences can also be seen in the blade tip region, which is the main reason in the minor differences before stall. Both grids, however, overpredict the separation levels at the wing tip compared to experiments."
    },
    {
      "id": "",
      "title": "",
      "transcript": "We examine the differences in the inboard region further, by extracting the off-body vorticity contours at a slice close to the main wing and nacelle pylon junction. The contours indicate a similar peak level of vorticity in the chine vortex, despite the region of mesh refinement in the ANSA grid. The ANSA grid, however, shows a much better resolution of the outer inboard flap and pylon-wing joint vortex pair which is likely to be the main contributor behind reduced separation seen further downstream for the ANSA grid."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Another sensitivity we examined is the effect of the rotation correction in the SA turbulence model. The integrated loads are presented here for the ANSA C Level grid. Once again very good agreement between both SA and SA-RC can be seen in the linear region of the lift curve, although the addition of the RC correction leads to better pitching moment prediction compared to experiments at low alpha. However, the SA-RC results lead to earlier stall than the pure SA predictions, leading to poorer agreement with experiments at high alpha."
    },
    {
      "id": "",
      "title": "",
      "transcript": "The primary reason for this behaviour is a strong separation at the root of the wing seen for the SA-RC results. The separation patterns at the wing tip also show some differences, as separation is seen past different slat brackets, although this is not the main driver behind poorer agreement with experiments for the SA-RC model."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To determine whether the SA-RC model is actually reducing the turbulent eddy viscosity in the vortex cores, off-body vorticity contours are extracted just upstream of the wing nacelle pylon junction. It can be seen that the SA-RC model leads to significantly higher peak vorticity in the chine vortex compared to the SA model. The chine vortex core radius is also lower."
    },
    {
      "id": "",
      "title": "",
      "transcript": "The final sensitivity that we examined for RANS calculations is the solution initialization strategy. Here, we compare solutions initialized from freestream, labelled as cold-start against solutions initialized from the previous angle of attack, labelled as warm-start. We also have results that we only warm-started near stall. The warm-started solutions have closer agreement with experimental data, whereas the cold-started solutions stall abruptly near CL max. One aspect of steady RANS simulations is the fact that if separated flow develops during the start-up phase or the convergence history, it is very difficult for the flow to reattach which is the likely cause behind these differences."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To examine the physics of where the differences come from it can be seen that the cold-started solutions develop strong separation past the nacelle, whereas the warm started solutions show a much narrower band of reduced skin friction. Another contributor to these differences is likely to be the flow topology on the nacelle, as the cold-started solution shows separated flow at the lip of the nacelle, which is not present for the warm-started solutions. The nacelle separation affects the downstream flow topology and interactions between the different vortical structures of the high-lift wing system. A slight shift between the two warm-started solutions is also examined and it can be seen that these differences occur due to separations across the wing tip. The warm-started solution from 17.05 degrees shows reduced separation from a more outboard slat bracket."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Based on the results shown here, it appears that RANS predictions exhibit a strong mesh sensitivity and even at 200 million nodes the solutions are not fully mesh converged. This is primarily due to the need to resolve all the flow structure interactions in the inboard regions. There also appears to be a sensitivity to initial conditions, although these may have been exacerbated by the mesh. To further support our conclusions, in terms of the assessment of RANS for high-lift predictions we performed DES simulations which will be analysed further in the next part of this video series. Thank you."
    }
  ]
}
