{
  "title": "Inverse Design: Lecture 4",
  "pages": [
    {
      "id": "",
      "title": "",
      "transcript": "In this lecture, we will continue our discussion on inverse design in photonics. Here we will describe a technique that allows us to incorporate basic feature constraints."
    },
    {
      "id": "",
      "title": "",
      "transcript": "As a brief review, last time we gave a simple demo of using inverse design to make a lens. In this design, we have a source and a desired focusing spot. The goal is then to design the region in between such that the wave generated by the source will be focused in the intended focusing region. The design was achieved by simply adjusting the value of the relative permittivty at each point inside the design region. From the animation, one can see that it works reasonably well as, with a few iterations, it can accomplish the desired focusing behavior. However, in reality, there is a lot more that you need to do to produce a design that satisfies fabrication constraints, which we will be discussing in these slides."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To start, let’s discuss what kind of fabrication constraints you may typically encounter. In silicon photonics, for example, one might design devices by etching a thin film of silicon. In the image above we show one such device comprising of a a silicon ring coupled to a waveguide. The resulting device therefore contains regions of only silicon and air. Therefore, in our inverse design process, there are technically only two possible permittivity values that should be allowed in our final device: that of silicon and that of air. This fact needs to be taken into account in the optimization algorithm to produce a structure that can be fabricated. In fact, there many other fabrication constraints one might apply to this process. For example, if your structure is defined using photolithography, there may be a minimum feature size that one can reliably produce depending on the fabrication technique, which must be taken into account as well. In general, one needs to consider all of these effects when designing the photonic device to ensure the final device is usable."
    },
    {
      "id": "",
      "title": "",
      "transcript": "We will use a mode converter as a simple device to illustrate how to incorporate some of these concepts into our design algorithm. The mode converter consists of an input waveguide connected to an output waveguide, both support multiple modes. The intent of the device is to convert one eigenmode of the input waveguide to another eigenmode of the output waveguide with as high of an efficiency as possible. One can attempt to accomplish this by placing a “design region” between the two waveguides to produce the desired conversion. In the silicon photonics context, this design region would consist of a thin silicon film sitting on top of the silicon dioxide substrate that can be etched with a desired pattern. The goal, therefore is to find the pattern to etch such that the design region still consists of air and silicon but is able to convert the two modes as required. To be more specific, we can define the objective function to maximize as the overlap integral between the actual measured output waveguide field pattern and that of the desired mode."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Now, one can apply the same approach as we’ve shown in previous lectures to directly modify the relative permittivity of the design region using the gradient of this cost function. This approach will produce a design that works to convert modes, as we can see by the field intensity plot on the top right. In this plot, we are exciting the even fundamental mode of the input waveguide on the left hand side, and the output waveguide shows that we are exciting the first high order mode on the right hand side, which is clearly odd. However, looking at the structure that produced this functionality, one can clearly see that it is has a continuous variation from the permittivity of air to the permittivity of silicon.  In this sense, it would not be possible to fabricate such a device using our etching technique. Moreover, we would ideally like to have a feature size that is large enough to be able to etch with the resolution afforded to us by our fabrication process."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To incorporate these kinds of fabrication constraints more generally, the key insight is that one should not directly optimize the relative permittivity. Instead, one can imagine a function that takes the parameters and generates the relative permittivity as its output. One can then craft this function to incorporate any feature size constraint that you care about. For example, one can modify this function to incorporate operations that bias the structure towards being one of two permittivity values (binarization) or feature size constraints."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Before discussing the specifics of this function, it is important to point out that we must ensure that it is smooth and differentiable. The reason is that when we want to optimize this device through gradient-based methods, we need to be able to compute the gradient of our objective function with respect to the raw parameter values. The adjoint method gives us a way to do this, but it requires us being able to propagate the derivative information backwards through our device parameterization function. Therefore, the derivative of this function must be well-defined for us to optimize in our parameter space."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To illustrate the points we’ve discussed so far, let’s introduce one method for binarization of our device. Let’s imagine our parameter values (p) can range between negative infinity and infinity, with p=0 representing the halfway point between our two limits of the permittivity. We can introduce a hyperbolic tangent function to convert between parameter values and permittivity values. The function has an extra parameter “beta”, which controls the “steepness” of the projection. On the right hand side, we plot the tanh function with varying values of beta and see that for small beta, the projection is almost linear. However, as beta increases, it begins to look like a step function. A high beta value therefore has the effect of applying binarization to our device and one can tune this parameter either during or after optimization to help produce a binary structure. In short, the gradient-based optimization will still tune parameters in the parameter space, but passing the values through this tanh function will result in more binarized permittivity values."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To illustrate this effect, here are the results of three optimizations with different values of beta in the tanh projection. As we can see, increasing the beta has the effect of creating more binarized structures, whereas the low beta structures tend to have permittivities between that of air and silicon. From looking at the field plots, we also notice that all three structures successfully perform the mode conversion. While this is an important first step, we still notice that the permittivity of the binarized structure varies rapidly from pixel to pixel. Therefore it would be very difficult to actually fabricate such a structure without introducing some kind of constraint on the feature size."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To introduce feature size constraints, we will add another process to the pipeline of mapping from parameter space to the permittivity values in our device. We now imagine a two step process, we still have a parameter space that can vary pixel-by-pixel. However, before passing through our hyperbolic tangent projection function, we will first convolve our parameters with a kernel so that we can “smooth” the values in real space a bit. We choose a kernel with a radius R, where the larger R produces more smoothed out values, producing larger feature size. Through this parameter, one can therefore control how large of feature size is present in the final device. As we discussed, both of these functions are smooth and differentiable, so it is possible to pass gradient information backwards through this mapping for optimization."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Here are some results of optimizing the mode converter with three values of R. When R=0, we notice that the results are very pixelated, with extremely small feature size. As R increases to 100nm, we start to see larger feature sizes, which get even larger as we further increase R. Again, all three devices seem to convert modes as desired based on their field profiles."
    },
    {
      "id": "",
      "title": "",
      "transcript": "Here we apply the procedure we’ve layed out on a three dimensional optimization problem. We set up our device as a thin film of silicon on a silicon dioxide substrate and optimize the pattern etched onto the silicon in the design region. We introduce a conic filter with radius of 500nm and a tanh projection with beta=200. We show the top view of the structure and the field patterns after 50 iterations of optimization. The final device works as intended to convert the waveguide modes and also exhibits large feature size and mostly binarized permittivity values."
    },
    {
      "id": "",
      "title": "",
      "transcript": "To summarize, an important idea to incorporate fabrication constraints in inverse design is to imagine a mapping from your optimization parameter space to your structure. One can then craft this parameterization to incorporate any of the constraints that you might care about in your application. Of course, in this simple example, we introduced some basic constraints, but there are a lot of degrees of freedom that could be introduced so one must think carefully about such choice of parameterization. In future lectures we will go into more details about these considerations."
    }
  ]
}
